app/controllers/posts_controller.rb

  def index
    @user = User.find_by(id: params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Hello"], ["body", "Hi!"], ["created_at", "2016-05-02 20:07:24.510670"], ["updated_at", "2016-05-02 20:07:24.510670"]]