app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY "posts"."id" ASC LIMIT 1
---
  def index
    @posts = Post.all